const { solution } = require("./스타트와 링크");

test("예제 1: N=4, 최소 차이 0", () => {
	const n = 4;
	const stats = [
		[0, 1, 2, 3],
		[4, 0, 5, 6],
		[7, 1, 0, 2],
		[3, 4, 5, 0],
	];
	expect(solution(n, stats)).toBe(0);
});

test("예제 2: N=6, 최소 차이 2", () => {
	const n = 6;
	const stats = [
		[0, 1, 2, 3, 4, 5],
		[1, 0, 2, 3, 4, 5],
		[1, 2, 0, 3, 4, 5],
		[1, 2, 3, 0, 4, 5],
		[1, 2, 3, 4, 0, 5],
		[1, 2, 3, 4, 5, 0],
	];
	expect(solution(n, stats)).toBe(2);
});

test("예제 3: N=8, 최소 차이 1", () => {
	const n = 8;
	const stats = [
		[0, 5, 4, 5, 4, 5, 4, 5],
		[4, 0, 5, 1, 2, 3, 4, 5],
		[9, 8, 0, 1, 2, 3, 1, 2],
		[9, 9, 9, 0, 9, 9, 9, 9],
		[1, 1, 1, 1, 0, 1, 1, 1],
		[8, 7, 6, 5, 4, 0, 3, 2],
		[9, 1, 9, 1, 9, 1, 0, 9],
		[6, 5, 4, 3, 2, 1, 9, 0],
	];
	expect(solution(n, stats)).toBe(1);
});
