const { solution } = require("./연구소");

test("예제 1: 7x7 연구소, 안전 영역 최댓값 27", () => {
	const n = 7;
	const m = 7;
	const map = [
		[2, 0, 0, 0, 1, 1, 0],
		[0, 0, 1, 0, 1, 2, 0],
		[0, 1, 1, 0, 1, 0, 0],
		[0, 1, 0, 0, 0, 0, 0],
		[0, 0, 0, 0, 0, 1, 1],
		[0, 1, 0, 0, 0, 0, 0],
		[0, 1, 0, 0, 0, 0, 0],
	];
	expect(solution(n, m, map)).toBe(27);
});

test("예제 2: 4x6 연구소, 안전 영역 최댓값 9", () => {
	const n = 4;
	const m = 6;
	const map = [
		[0, 0, 0, 0, 0, 0],
		[1, 0, 0, 0, 0, 2],
		[1, 1, 1, 0, 0, 2],
		[0, 0, 0, 0, 0, 2],
	];
	expect(solution(n, m, map)).toBe(9);
});

test("예제 3: 8x8 연구소, 안전 영역 최댓값 3", () => {
	const n = 8;
	const m = 8;
	const map = [
		[2, 0, 0, 0, 0, 0, 0, 2],
		[2, 0, 0, 0, 0, 0, 0, 2],
		[2, 0, 0, 0, 0, 0, 0, 2],
		[2, 0, 0, 0, 0, 0, 0, 2],
		[2, 0, 0, 0, 0, 0, 0, 2],
		[0, 0, 0, 0, 0, 0, 0, 0],
		[0, 0, 0, 0, 0, 0, 0, 0],
		[0, 0, 0, 0, 0, 0, 0, 0],
	];
	expect(solution(n, m, map)).toBe(3);
});
